do

local function run(msg, matches)
local reply_id = msg['id']
if is_momod(msg) and matches[1]== 'الاوامر' then
local S = [[  🔺🔺🔺🔺🔺🔺🔺🔺🔺🔺🔺🔺🔺
◀️◀️ اوامر الرفع والتنزيل في المجموعة 📤📥 ▶️▶️
🔻🔻🔻🔻🔻🔻🔻🔻🔻🔻🔻🔻🔻
⛩-رفع اداري ◀️ لرفع اداري ✔️
⛩-تنزيل اداري ◀️ لحذف الاداري ✔️ 
⛩-رفع المدير ◀️ اضافة مدير ✔️
⛩-رفع ادمن ◀️ لاضافة  ادمن ✔️
⛩-تنزيل ادمن ◀️ تنزيل ادمن  ✔️
⛩-الادمنيه ◀️ اضهار الادمنيه ✔️
⛩-مدير المجموعه ◀️ اضهار المدير✔️
🔺🔺🔺🔺🔺🔺🔺🔺🔺🔺🔺🔺🔺
◀️◀️ اوامر الحظر و الطرد داخل المجموعة 💠🏌 ▶️▶️
🔻🔻🔻🔻🔻🔻🔻🔻🔻🔻🔻🔻🔻
🔮-بلوك ◀️ لطرد المستخدم ✔️
🔮-حظر  ◀️  لحضر المستخدم ✔️
🔮-الغاء الحظر  ◀️ لفك حضر المستخدم ✔️
🔮-مغادره  ◀️ للخروج من لمجموعه ✔️
🔮-كتم ◀️ لكتم المستخدم ✔️
🔮-كتم ◀️ لالغاء كتم المستخدم ✔️
🔮-المكتومين ◀️ عرض المكتومين ✔️
🔮-منع ◀️ لحضر الكلمات في المجموعه ✔️
🔮-الغاء المنع  ◀️ لفتح حضر الكلمه ✔️
🔮-قائمه المنع  ◀️ لعرض الكلمات المحضوره ✔️
🔮-حظر عام ◀️ باند عام ✔️
🔮-الغاء العام ◀️ لالغاء العام ✔️
🔮-قائمه العام  ◀️ لعرض المحضورين عام ✔️
🔺🔺🔺🔺🔺🔺🔺🔺🔺🔺🔺🔺🔺
◀️◀️ اوامر الكروب الاساسية 🔰⚜ ▶️▶️
🔻🔻🔻🔻🔻🔻🔻🔻🔻🔻🔻🔻🔻
🔴-ايدي ◀️ لعرض ايدي المجموعه ✔️
🔴-ايدي ◀️ لضهار ايدي الشخص بلرد ✔️
🔴-معلوماتي ◀️ اضهار المعلومات الخاصه بك ✔️
🔴-معلومات المجموعه ◀️ لاضهار معلومات المجموعه ✔️
🔴-القوانين ◀️ لاضهار القوانين ✔️
🔴-مسح ◀️ لمسح اي  كلمه بل رد ✔️
🔴-ضع قوانين ◀️ اضافه قوانين ✔️
🔴-ضع وصف ◀️ اضافة حول ✔️
🔴-وضع اسم ◀️ لاضافة اسم ✔️
🔴-ضع معرف ◀️ لوضع معرف للكروب ✔️
🔴-وضع صوره ◀️ لاضافة صورة ✔️
🔴-الرابط خاص ◀️ لجلب الرابط خاص ✔️
🔴-الرابط ◀️ لعرض الرابط ✔️
🔴-تغير الرابط ◀️ لصنع الرابط ✔️
🔴-ترقيه سوبر ◀️ لتحويل الى سوبر ✔️
🔴-تفعيل ◀️ لتفعيل المجموعة ✔️
🔴-تعطيل ◀️ الغاء تفعيل المجموعة ✔️
🔴-صوره ◀️ لتحويل الملصق الى صورة ✔️
🔴-موقعي ◀️ لمعرفه موقعك في المجموعه ✔️
🔴-الاعدادات ◀️ اضهار الاعدادات المجموعه ✔️
🔴اعدادات الوسائط ◀️ اضهار اعدادات الوسائط ✔️
🔺🔺🔺🔺🔺🔺🔺🔺🔺🔺🔺🔺🔺
◀️◀️ اوامر الحماية 🏌✔️ ▶️▶️
🔻🔻🔻🔻🔻🔻🔻🔻🔻🔻🔻🔻🔻
🏳-(فتح/قفل) ◀️ الاضافه ✔️
🏳-(فتح/قفل) ◀️البوتات ✔️
🏳-(فتح/قفل) ◀️ المجموعه ✔️
🏳-(فتح/قفل) ◀️ الدردشه ✔️
🏳-(فتح/قفل) ◀️ الصور ✔️
🏳-(فتح/قفل) ◀️ الصوت ✔️
🏳-(فتح/قفل) ◀️ الفيديو ✔️
🏳-(فتح/قفل) ◀️ الروابط ✔️
🏳-(فتح/قفل) ◀️ التكرار ✔️
🏳-(فتح/قفل) ◀️ الملصقات ✔️
🏳-(فتح/قفل) ◀️ الصور المتحركه ✔️ 
🏳-(فتح/قفل) ◀️ الفايلات ✔️
🏳-(فتح/قفل) ◀️ الكلايش ✔️
🏳-(فتح/قفل) ◀️ الاضافه الجماعيه ✔️ 
🏳-(فتح/قفل) ◀️ العربيه  ✔️  
🏳-(فتح/قفل) ◀️ اعاده توجيه ✔️
🏳-المراقبه نعم✔️ لا❌ 🔜
🏳-ضع التكرار ➕ عدد التكرار المرغوب به ✔️
🔺🔺🔺🔺🔺🔺🔺🔺🔺🔺🔺🔺🔺
◀️◀️ اوامر المسح ❌ ▶️▶️
🔻🔻🔻🔻🔻🔻🔻🔻🔻🔻🔻🔻🔻
🏴-مسح رسائل المجموعه ⬅️ لحذف جميع رسائل الكروب ✔️
🏴-مسح رسائل العضو ⬅️ مسح جميع رسائل العضو بالرد ✔️
🏴-مسح الادمنية ⬅️ لحذف الادمنية ✔️
️🏴-مسح الوصف ⬅️ لحذف الوصف ✔️
️🏴-مسح القوانين ⬅️ لحذف القوانين ✔️
️🏴-مسح المعرف ⬅️ لحذف معرف المجموعة ✔️ 
🏴-انستا : + يوزر ⬅️ يستعمل لجلب معلومات حساب الانستا مع الصور ✔️
__________________
💠 #Dev - @II07II
💠 - channel - https://telegram.me/joinchat/CUf-ST-UwlYXKMQWuHjVYw
💠 - group bot- @HL_HOST_BOT

]]
reply_msg(reply_id, S, ok_cb, false)
end

if not is_momod(msg) then
local S = "للمشرفين والادمنية فقط 💠🏌"
reply_msg(reply_id, S, ok_cb, false)
end

end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"^(الاوامر)$",
},
run = run 
}
end
